results/ai-agent/logs/cpu-spike-logs/k6-cpu-spike-run4.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: -
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 1m30s max duration (incl. graceful stop):
              * default: Up to 40 looping VUs for 1m0s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 04/40 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 04/40 VUs  0m01.0s/1m00.0s

running (0m02.0s), 08/40 VUs, 5 complete and 0 interrupted iterations
default   [   3% ] 08/40 VUs  0m02.0s/1m00.0s

running (0m03.0s), 12/40 VUs, 15 complete and 0 interrupted iterations
default   [   5% ] 12/40 VUs  0m03.0s/1m00.0s

running (0m04.0s), 16/40 VUs, 30 complete and 0 interrupted iterations
default   [   7% ] 16/40 VUs  0m04.0s/1m00.0s

running (0m05.0s), 20/40 VUs, 57 complete and 0 interrupted iterations
default   [   8% ] 20/40 VUs  0m05.0s/1m00.0s

running (0m06.0s), 24/40 VUs, 84 complete and 0 interrupted iterations
default   [  10% ] 24/40 VUs  0m06.0s/1m00.0s

running (0m07.0s), 28/40 VUs, 114 complete and 0 interrupted iterations
default   [  12% ] 28/40 VUs  0m07.0s/1m00.0s

running (0m08.0s), 32/40 VUs, 154 complete and 0 interrupted iterations
default   [  13% ] 32/40 VUs  0m08.0s/1m00.0s

running (0m09.0s), 36/40 VUs, 196 complete and 0 interrupted iterations
default   [  15% ] 36/40 VUs  0m09.0s/1m00.0s

running (0m10.0s), 39/40 VUs, 240 complete and 0 interrupted iterations
default   [  17% ] 39/40 VUs  0m10.0s/1m00.0s

running (0m11.0s), 40/40 VUs, 283 complete and 0 interrupted iterations
default   [  18% ] 40/40 VUs  0m11.0s/1m00.0s

running (0m12.0s), 40/40 VUs, 332 complete and 0 interrupted iterations
default   [  20% ] 40/40 VUs  0m12.0s/1m00.0s

running (0m13.0s), 40/40 VUs, 383 complete and 0 interrupted iterations
default   [  22% ] 40/40 VUs  0m13.0s/1m00.0s

running (0m14.0s), 40/40 VUs, 435 complete and 0 interrupted iterations
default   [  23% ] 40/40 VUs  0m14.0s/1m00.0s

running (0m15.0s), 40/40 VUs, 483 complete and 0 interrupted iterations
default   [  25% ] 40/40 VUs  0m15.0s/1m00.0s

running (0m16.0s), 40/40 VUs, 531 complete and 0 interrupted iterations
default   [  27% ] 40/40 VUs  0m16.0s/1m00.0s

running (0m17.0s), 40/40 VUs, 578 complete and 0 interrupted iterations
default   [  28% ] 40/40 VUs  0m17.0s/1m00.0s

running (0m18.0s), 40/40 VUs, 631 complete and 0 interrupted iterations
default   [  30% ] 40/40 VUs  0m18.0s/1m00.0s

running (0m19.0s), 40/40 VUs, 683 complete and 0 interrupted iterations
default   [  32% ] 40/40 VUs  0m19.0s/1m00.0s

running (0m20.0s), 40/40 VUs, 728 complete and 0 interrupted iterations
default   [  33% ] 40/40 VUs  0m20.0s/1m00.0s

running (0m21.0s), 40/40 VUs, 772 complete and 0 interrupted iterations
default   [  35% ] 40/40 VUs  0m21.0s/1m00.0s

running (0m22.0s), 40/40 VUs, 823 complete and 0 interrupted iterations
default   [  37% ] 40/40 VUs  0m22.0s/1m00.0s

running (0m23.0s), 40/40 VUs, 873 complete and 0 interrupted iterations
default   [  38% ] 40/40 VUs  0m23.0s/1m00.0s

running (0m24.0s), 40/40 VUs, 921 complete and 0 interrupted iterations
default   [  40% ] 40/40 VUs  0m24.0s/1m00.0s

running (0m25.0s), 40/40 VUs, 973 complete and 0 interrupted iterations
default   [  42% ] 40/40 VUs  0m25.0s/1m00.0s

running (0m26.0s), 40/40 VUs, 1020 complete and 0 interrupted iterations
default   [  43% ] 40/40 VUs  0m26.0s/1m00.0s

running (0m27.0s), 40/40 VUs, 1070 complete and 0 interrupted iterations
default   [  45% ] 40/40 VUs  0m27.0s/1m00.0s

running (0m28.0s), 40/40 VUs, 1123 complete and 0 interrupted iterations
default   [  47% ] 40/40 VUs  0m28.0s/1m00.0s

running (0m29.0s), 40/40 VUs, 1170 complete and 0 interrupted iterations
default   [  48% ] 40/40 VUs  0m29.0s/1m00.0s

running (0m30.0s), 40/40 VUs, 1225 complete and 0 interrupted iterations
default   [  50% ] 40/40 VUs  0m30.0s/1m00.0s

running (0m31.0s), 40/40 VUs, 1270 complete and 0 interrupted iterations
default   [  52% ] 40/40 VUs  0m31.0s/1m00.0s

running (0m32.0s), 40/40 VUs, 1319 complete and 0 interrupted iterations
default   [  53% ] 40/40 VUs  0m32.0s/1m00.0s

running (0m33.0s), 40/40 VUs, 1368 complete and 0 interrupted iterations
default   [  55% ] 40/40 VUs  0m33.0s/1m00.0s

running (0m34.0s), 40/40 VUs, 1424 complete and 0 interrupted iterations
default   [  57% ] 40/40 VUs  0m34.0s/1m00.0s

running (0m35.0s), 40/40 VUs, 1472 complete and 0 interrupted iterations
default   [  58% ] 40/40 VUs  0m35.0s/1m00.0s

running (0m36.0s), 40/40 VUs, 1522 complete and 0 interrupted iterations
default   [  60% ] 40/40 VUs  0m36.0s/1m00.0s

running (0m37.0s), 40/40 VUs, 1574 complete and 0 interrupted iterations
default   [  62% ] 40/40 VUs  0m37.0s/1m00.0s

running (0m38.0s), 40/40 VUs, 1627 complete and 0 interrupted iterations
default   [  63% ] 40/40 VUs  0m38.0s/1m00.0s

running (0m39.0s), 40/40 VUs, 1672 complete and 0 interrupted iterations
default   [  65% ] 40/40 VUs  0m39.0s/1m00.0s

running (0m40.0s), 40/40 VUs, 1722 complete and 0 interrupted iterations
default   [  67% ] 40/40 VUs  0m40.0s/1m00.0s

running (0m41.0s), 40/40 VUs, 1772 complete and 0 interrupted iterations
default   [  68% ] 40/40 VUs  0m41.0s/1m00.0s

running (0m42.0s), 40/40 VUs, 1823 complete and 0 interrupted iterations
default   [  70% ] 40/40 VUs  0m42.0s/1m00.0s

running (0m43.0s), 40/40 VUs, 1873 complete and 0 interrupted iterations
default   [  72% ] 40/40 VUs  0m43.0s/1m00.0s

running (0m44.0s), 40/40 VUs, 1922 complete and 0 interrupted iterations
default   [  73% ] 40/40 VUs  0m44.0s/1m00.0s

running (0m45.0s), 40/40 VUs, 1969 complete and 0 interrupted iterations
default   [  75% ] 40/40 VUs  0m45.0s/1m00.0s

running (0m46.0s), 40/40 VUs, 2024 complete and 0 interrupted iterations
default   [  77% ] 40/40 VUs  0m46.0s/1m00.0s

running (0m47.0s), 40/40 VUs, 2074 complete and 0 interrupted iterations
default   [  78% ] 40/40 VUs  0m47.0s/1m00.0s

running (0m48.0s), 40/40 VUs, 2124 complete and 0 interrupted iterations
default   [  80% ] 40/40 VUs  0m48.0s/1m00.0s

running (0m49.0s), 40/40 VUs, 2173 complete and 0 interrupted iterations
default   [  82% ] 40/40 VUs  0m49.0s/1m00.0s

running (0m50.0s), 40/40 VUs, 2221 complete and 0 interrupted iterations
default   [  83% ] 40/40 VUs  0m50.0s/1m00.0s

running (0m51.0s), 39/40 VUs, 2274 complete and 0 interrupted iterations
default   [  85% ] 39/40 VUs  0m51.0s/1m00.0s

running (0m52.0s), 33/40 VUs, 2321 complete and 0 interrupted iterations
default   [  87% ] 33/40 VUs  0m52.0s/1m00.0s

running (0m53.0s), 30/40 VUs, 2370 complete and 0 interrupted iterations
default   [  88% ] 30/40 VUs  0m53.0s/1m00.0s

running (0m54.0s), 26/40 VUs, 2412 complete and 0 interrupted iterations
default   [  90% ] 26/40 VUs  0m54.0s/1m00.0s

running (0m55.0s), 22/40 VUs, 2451 complete and 0 interrupted iterations
default   [  92% ] 22/40 VUs  0m55.0s/1m00.0s

running (0m56.0s), 19/40 VUs, 2480 complete and 0 interrupted iterations
default   [  93% ] 19/40 VUs  0m56.0s/1m00.0s

running (0m57.0s), 14/40 VUs, 2508 complete and 0 interrupted iterations
default   [  95% ] 14/40 VUs  0m57.0s/1m00.0s

running (0m58.0s), 11/40 VUs, 2526 complete and 0 interrupted iterations
default   [  97% ] 11/40 VUs  0m58.0s/1m00.0s

running (0m59.0s), 06/40 VUs, 2540 complete and 0 interrupted iterations
default   [  98% ] 06/40 VUs  0m59.0s/1m00.0s

running (1m00.0s), 01/40 VUs, 2550 complete and 0 interrupted iterations
default   [ 100% ] 01/40 VUs  1m00.0s/1m00.0s


  █ TOTAL RESULTS 

    checks_total.......: 7653   126.806853/s
    checks_succeeded...: 66.66% 5102 out of 7653
    checks_failed......: 33.33% 2551 out of 7653

    ✓ Homepage loaded
    ✓ Added to cart
    ✗ Checkout successful
      ↳  0% — ✓ 0 / ✗ 2551

    HTTP
    http_req_duration..............: avg=184.64ms min=144.21ms med=180.62ms max=1.13s p(90)=220.67ms p(95)=231.09ms
      { expected_response:true }...: avg=185.57ms min=144.21ms med=178.38ms max=1.13s p(90)=224.84ms p(95)=235.69ms
    http_req_failed................: 25.00% 2551 out of 10204
    http_reqs......................: 10204  169.075804/s

    EXECUTION
    iteration_duration.............: avg=791.64ms min=654.4ms  med=797.37ms max=1.97s p(90)=858.03ms p(95)=882.88ms
    iterations.....................: 2551   42.268951/s
    vus............................: 1      min=1             max=40
    vus_max........................: 40     min=40            max=40

    NETWORK
    data_received..................: 82 MB  1.4 MB/s
    data_sent......................: 2.6 MB 43 kB/s



running (1m00.4s), 00/40 VUs, 2551 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/40 VUs  1m0s